app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches"
SELECT "students".* FROM "students" ORDER BY name ASC
SELECT COUNT(*) FROM "students"
---
  def index
    # Match.remove_matches
    # Match.create_matches2
    @matches = Match.all
    @students = Student.all
    @student_count = @students.count

INSERT INTO "matches" ("created_at", "updated_at", "student1", "student2", "day") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2017-08-09 14:02:21.992766"], ["updated_at", "2017-08-09 14:02:21.992766"], ["student1", "Sarah"], ["student2", "Patrick"], ["day", 1]]
---
  def my_method
    Match.remove_matches
    Student.remove_dummy
    Match.create_matches2