app/controllers/matches_controller.rb

  def index
    Match.remove_matches
    Match.create_matches2
---
INSERT INTO "matches" ("created_at", "updated_at", "student1", "student2") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-06-09 12:31:47.553673"], ["updated_at", "2017-06-09 12:31:47.553673"], ["student1", "Balacke"], ["student2", "Shay Nay Nay"]]