app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY name ASC
SELECT COUNT(*) FROM "students"
---
  def index
    @students = Student.all.chronological
    @student_count = @students.count

INSERT INTO "students" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jimbo"], ["created_at", "2017-08-10 21:49:54.742847"], ["updated_at", "2017-08-10 21:49:54.742847"]]
---
  def create
    @student = Student.new(student_params)

    if @student.save